ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_CDC.c
#endif /* USB_CDC_LINE_CODING_SUPPORTED || USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_STATE_REPORTING_SUPPORTED
/**
  * @brief Buffer Line State Report package
  */
static struct
{
    USB_SetupPacket_TypeDef SetupPacket;
    uint16_t LineState;
} CDC_StateReportPacket =
{
    {
        (USB_DEVICE_TO_HOST | USB_TYPE_CLASS | USB_RECIPIENT_INTERFACE), /* mRequestTypeData */
        USB_CDC_SERIAL_STATE,                                            /* bRequest */
        0,                                                               /* wValue */
        1,                                                               /* wIndex */
        2                                                                /* wLength */
    },
    0                                                                  /* LineState */
};
#endif /* USB_CDC_STATE_REPORTING_SUPPORTED */

/** @} */ /* End of group USB_CDC_Private_Variables */


/** @defgroup USB_CDC_Private_FunctionPrototypes USB CDC Private Function Prototypes
  * @{
  */

static USB_Result USB_CDC_OnDataSent(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length);
static USB_Result USB_CDC_OnDataReceive(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length);
static USB_Result USB_CDC_DoDataOut(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length);

/** @} */ /* End of group USB_CDC_Private_FunctionPrototypes */

/** @defgroup USB_CDC_Private_Functions USB CDC Private Functions
  * @{
  */


/**
  * @brief  Initializes CDC context.
  * @param  ReceiveBuffer: Pointer to memory buffer to place incoming
  *         data to. The buffer length should be equal or greater
  *         then MAX_PACKET_LENGTH and DataPortionLength.
  * @param  DataPortionLength: Amount of data received that triggers
  *         USB_CDC_HANDLE_DATA_RECEIVE handler to be called. If any
  *         data should be immediately handled, this parameter should
  *         be set to 1.
  * @param  StartReceiving - @ref FlagStatus - Flag indicating whether
  *         the device will accept incoming data immediately after
  *         USB_CDC_Reset is called for the first time.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_Init(uint8_t* ReceiveBuffer, uint32_t DataPortionLength, FlagStatus StartReceiving)
{
    USB_CDC_SetReceiveBuffer(ReceiveBuffer, DataPortionLength);
    USB_CDCContext.CDC_SendDataStatus = USB_SUCCESS;
    USB_CDCContext.CDC_ReceiveDataStatus = StartReceiving ? USB_SUCCESS : USB_ERR_BUSY;

    return USB_SUCCESS;
}


/**
  * @brief  Sets the (new) buffer for incoming data.
  * @param  ReceiveBuffer: Pointer to memory buffer to place incoming
  *         data to. The buffer length should be equal or greater
  *         then MAX_PACKET_LENGTH and DataPortionLength.
  * @param  DataPortionLength: Amount of data received that triggers
  *         USB_CDC_HANDLE_DATA_RECEIVE handler to be called. If any
  *         data should be immediately handled, this parameter should
  *         be set to 1.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_SetReceiveBuffer(uint8_t* ReceiveBuffer, uint32_t DataPortionLength)
{
    /* Check the parameters */
    assert_param(ReceiveBuffer);

    USB_CDCContext.CDC_ReceiveBuffer = ReceiveBuffer;
    USB_CDCContext.CDC_DataPortionLength = DataPortionLength;

    return USB_SUCCESS;
}

/**
  * @brief  Starts (or restarts) incoming data receiving.
  * @param  None.
  * @retval @ref USB_Result.
  *
  */
USB_Result USB_CDC_ReceiveStart(void)
{
    USB_CDCContext.CDC_ReceiveDataStatus = USB_SUCCESS;

    return USB_EP_doDataOut(USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive);
}

/**
  * @brief  Stops (suspends) incoming data receiving.
  * @param  None.
  * @retval USB_Result.
  */
USB_Result USB_CDC_ReceiveStop(void)
{
    USB_CDCContext.CDC_ReceiveDataStatus = USB_ERR_BUSY;

    return USB_EP_Stall(USB_CDC_EP_RECEIVE, USB_STALL_PROTO);
}

/**
  * @brief  Initiates sending of data portion to the host
  * @note   The function returns immediately.
  * @param  Buffer: Pointer to the user's buffer containing data
  *         to be sent
  * @param  Length: Length of data
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_SendData(uint8_t* Buffer, uint32_t Length)
{
    /* Check if previous data sending is complete */
    USB_Result result = USB_CDCContext.CDC_SendDataStatus;

    /* If data can be sent, set "busy" flag and initiate data portion transfer */
    if (result == USB_SUCCESS)
    {
        USB_CDCContext.CDC_SendDataStatus = USB_ERR_BUSY;
        result = USB_EP_doDataIn(USB_CDC_EP_SEND, Buffer, Length, USB_CDC_OnDataSent);
    }

    return result;
}

#ifdef USB_CDC_STATE_REPORTING_SUPPORTED
/**
  * @brief  Sends special Line State Report to host
  * @note   The function returns immediately.
  * @param  LineState: Coded line state.
  *         This parameter can be any combination of the following values:
  *             @arg USB_CDC_bRxCarrier
  *             @arg USB_CDC_bTxCarrier
  *             @arg USB_CDC_bBreak
  *             @arg USB_CDC_bRingSignal
  *             @arg USB_CDC_bFraming
  *             @arg USB_CDC_bParity
  *             @arg USB_CDC_bOverRun
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_ReportState(uint16_t LineState)
{
    CDC_StateReportPacket.LineState = LineState;

    return USB_EP_doDataIn(USB_CDC_EP_STATE, (uint8_t*)&CDC_StateReportPacket, sizeof(CDC_StateReportPacket), 0);
}
#endif /* USB_CDC_STATE_REPORTING_SUPPORTED */

/** @defgroup USB_CDC_Private_Overwritten_Device_Handlers USB CDC Overwritten Device Handlers implementation
  * @{
  */

/**
  * @brief  Initial CDC setup/reset
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_Reset(void)
{
    USB_Result result;

    /* Inherited handler call */
    result = USB_DeviceReset();

    if (result == USB_SUCCESS)
    {
        /* EP1, EP2 and EP3 initialization. Note: DATA1 bit would be toggled to DATA0 on the first
        * IN transaction */
        USB_EP_Init(USB_CDC_EP_SEND, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1,
                    USB_CDC_HANDLE_SEND_ERROR);
        USB_EP_Init(USB_CDC_EP_STATE, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1,
                    USB_CDC_HANDLE_LINE_STATE_REPORT_SEND_ERROR);
        USB_EP_Init(USB_CDC_EP_RECEIVE, USB_SEPx_CTRL_EPEN_Enable, 0);

        /* Start to listen for incoming data, if desired */
        if (USB_CDCContext.CDC_ReceiveDataStatus == USB_SUCCESS)
        {
            result = USB_EP_doDataOut(USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                        USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive);
        }
    }

    return result;
}

/**
  * @brief  GET_DESCRIPTOR standard request handler implementation for CDC.
  * @note   This handler transmits to host an appropriate CDC descriptor data.
  * @param  wVALUE: Descriptor Type and Descriptor Index
  * @param  wINDEX: Not used
  * @param  wLENGTH: Amount of data host is willing to receive.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_GetDescriptor(uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH)
{
    uint8_t* pDescr = 0;
    uint32_t length;
    USB_Result result = USB_SUCCESS;

    /* Only 0 configuration is supported; for device request this field must be 0 */
    if ((wVALUE & 0xFF) != 0)
    {
        result = USB_ERROR;
    }
    else
    {
        switch (wVALUE >> 8)      /* Descriptor type */
        {
            case USB_DEVICE:
                pDescr = Usb_CDC_Device_Descriptor;
                length = 0x12;
                break;
            case USB_CONFIGURATION:
                pDescr = Usb_CDC_Configuration_Descriptor;
                length = 0x43;
                break;
            default:
                result = USB_ERROR;
        }
    }

    if (result == USB_SUCCESS)
    {
        if (length > wLENGTH)
        {
            length = wLENGTH;
        }
        result = USB_EP_doDataIn(USB_EP0, pDescr, length, USB_DeviceDoStatusOutAck);
    }

    return result;
}

/**
  * @brief  Class-type setup request handler for CDC.
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_ClassRequest(void)
{
    USB_Result result = USB_SUCCESS;

    uint16_t wValue = USB_CurrentSetupPacket.wValue,
            wIndex = USB_CurrentSetupPacket.wIndex,
            wLength = USB_CurrentSetupPacket.wLength;

    /* Specific requests */
    switch (USB_CurrentSetupPacket.bRequest)
    {
#ifdef USB_CDC_ENCAPSULATION_SUPPORTED
        /* SEND_ENCAPSULATED_COMMAND */
        case USB_CDC_SEND_ENCAPSULATED_COMMAND:
            result = USB_CDC_HANDLE_SEND_ENCAPSULATED_CMD(wIndex, wLength);
            break;
        /* GET_ENCAPSULATED_RESPONSE */
        case USB_CDC_GET_ENCAPSULATED_RESPONSE:
            result = USB_CDC_HANDLE_GET_ENCAPSULATED_RESP(wIndex, wLength);
            break;
#endif /* USB_CDC_ENCAPSULATION_SUPPORTED */

