ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_CDC.c
#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
        /* SET_COMM_FEATURE */
        case USB_CDC_SET_COMM_FEATURE:
            if (wLength == 2)
            {
                result = USB_EP_doDataOut(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_CDC_DoDataOut);
            }
            else
            {
                result = USB_ERR_INV_REQ;
            }
            break;
        /* GET_COMM_FEATURE */
        case USB_CDC_GET_COMM_FEATURE:
            if (wLength == 2)
            {
                result = USB_CDC_HANDLE_GET_COMM_FEATURE(wValue, wIndex, &CDC_ClassPacketData.CommFeature);
                if (result == USB_SUCCESS)
                {
                    result = USB_EP_doDataIn(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_DeviceDoStatusOutAck);
                }
            }
            else
            {
                result = USB_ERR_INV_REQ;
            }
            break;
        /* CLEAR_COMM_FEATURE */
        case USB_CDC_CLEAR_COMM_FEATURE:
            result = USB_CDC_HANDLE_CLEAR_COMM_FEATURE(wValue, wIndex);
            break;
#endif /* USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_LINE_CODING_SUPPORTED
        /* SET_LINE_CODING */
        case USB_CDC_SET_LINE_CODING:
            if (wLength == 7)
            {
                result = USB_EP_doDataOut(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_CDC_DoDataOut);
            }
            else
            {
                result = USB_ERR_INV_REQ;
            }
            break;
        /* GET_LINE_CODING */
        case USB_CDC_GET_LINE_CODING:
            if (wLength == 7)
            {
                result = USB_CDC_HANDLE_GET_LINE_CODING(wIndex, &CDC_ClassPacketData.LineCoding);
                if (result == USB_SUCCESS)
                {
                    result = USB_EP_doDataIn(USB_EP0, (uint8_t*)&CDC_ClassPacketData, wLength, USB_DeviceDoStatusOutAck);
                }
            }
            else
            {
                result = USB_ERR_INV_REQ;
            }
            break;
#endif /* USB_CDC_LINE_CODING_SUPPORTED */

#ifdef USB_CDC_CONTROL_LINE_STATE_SUPPORTED
        /* SET_CONTROL_LINE_STATE */
        case USB_CDC_SET_CONTROL_LINE_STATE:
            result = USB_CDC_HANDLE_CONTROL_LINE_STATE(wValue, wIndex);
            break;
#endif /* USB_CDC_CONTROL_LINE_STATE_SUPPORTED */

#ifdef USB_CDC_LINE_BREAK_SUPPORTED
        /* SEND_BREAK */
        case USB_CDC_SEND_BREAK:
            result = USB_CDC_HANDLE_BREAK(wValue, wIndex);
            break;
#endif /* USB_CDC_LINE_BREAK_SUPPORTED */

        default:
            result = USB_ERROR;
    }

    /* If there were no DATA stage, initiate Status Stage (IN ACK) */
    if (result == USB_SUCCESS && wLength == 0)
    {
        result = (USB_CurrentSetupPacket.mRequestTypeData & 0x80) == USB_DEVICE_TO_HOST ?
                 USB_EP_doDataOut(USB_EP0, 0, 0, 0) :
                 USB_EP_doDataIn(USB_EP0, 0, 0, 0);
    }

    return result;
}

/** @} */ /* End of group USB_CDC_Private_Overwritten_Device_Handlers */

/**
  * @brief  Handler called when data is sent.
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  Buffer: Pointer to the user's buffer with portion of data sent
  * @param  Length: Length of data portion
  * @retval @ref USB_Result.
  */
static USB_Result USB_CDC_OnDataSent(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
    /* Release "busy" flag and call user's handler */
    USB_CDCContext.CDC_SendDataStatus = USB_SUCCESS;

    return USB_CDC_HANDLE_DATA_SENT;
}


/**
  * @brief  Handler called when some data is received.
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  Buffer: Pointer to the user's buffer with received data
  * @param  Length: Length of data
  * @retval @ref USB_Result.
  */
static USB_Result USB_CDC_OnDataReceive(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
    /* Call user's handler */
    USB_Result result = USB_CDC_HANDLE_DATA_RECEIVE(Buffer, Length);

    /* If handler returns USB_SUCCESS, wait for another portion. Otherwise, stop to receive
    * incoming data */
    if (result != USB_SUCCESS)
    {
        USB_CDCContext.CDC_ReceiveDataStatus = USB_ERR_BUSY;
    }
    if (USB_CDCContext.CDC_ReceiveDataStatus == USB_SUCCESS)
    {
        return USB_EP_doDataOut(USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive);
    }
    else
    {
        return USB_SUCCESS;
    }
}


/**
  * @brief Implements Data stage of Setup transaction with OUT data stage
  *        for Class-Specific requests with data processing on CDC layer.
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  Buffer: Pointer to the user's buffer with portion of data to be sent
  * @param  Length: Length of data portion
  * @retval @ref USB_Result.
  */
static USB_Result USB_CDC_DoDataOut(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
    USB_Result result;

    switch (USB_CurrentSetupPacket.bRequest)
    {
#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
        /* USB_CDC_SET_COMM_FEATURE */
        case USB_CDC_SET_COMM_FEATURE:
            /* Call user's handler */
            result = USB_CDC_HANDLE_SET_COMM_FEATURE(USB_CurrentSetupPacket.wValue,
                                                    USB_CurrentSetupPacket.wIndex,
                                                    *((uint16_t*)Buffer));
            break;
#endif /* USB_CDC_COMM_FEATURE_SUPPORTED */
#ifdef USB_CDC_LINE_CODING_SUPPORTED
        /* USB_CDC_SET_LINE_CODING */
        case USB_CDC_SET_LINE_CODING:
            /* Call user's handler */
            result = USB_CDC_HANDLE_SET_LINE_CODING(USB_CurrentSetupPacket.wIndex,
                                                    (const USB_CDC_LineCoding_TypeDef*)Buffer);
            break;
#endif /* USB_CDC_LINE_CODING_SUPPORTED */
        default:
            result = USB_ERR_INV_REQ;
    }

    /* Initiate Status Stage */
    return result == USB_SUCCESS ? USB_EP_doDataIn(EPx, 0, 0, 0) : result;
}

/** @defgroup USB_CDC_Private_Dummy_Functions USB CDC Handlers implementation
  * @{
  */

/**
  * @brief  The sample of handler called when data is received from host.
  * @param  Buffer: Pointer to buffer containing data (same as ReceiveBuffer)
  * @param  Length: Received data length
  * @retval @ref USB_Result. If USB_SUCCESS is returned, the device continues
  *         to receive incoming data, stops otherwise.
  */
USB_Result USB_CDC_DummyDataReceive(uint8_t* Buffer, uint32_t Length)
{
    return USB_ERROR;
}

/**
  * @brief  The sample of handler called when data sending is complete
  *         (successfully or with error)
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummyDataSent(void)
{
    return USB_ERROR;
}

#ifdef USB_CDC_ENCAPSULATION_SUPPORTED
/**
  * @brief  SEND_ENCAPSULATED_COMMAND class-specific packet handler sample ([1], 6.2.1).
  * @note   The handler is expected to either perform data transfer and status
  *         stages on its own (calling USB_EP_doDataOut), or return value
  *         that is not USB_SUCCESS.
  * @param  wINDEX: Interface number
  * @param  wLENGTH: Amount of data
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummySendEncapsulatedCMD(uint16_t wINDEX, uint16_t wLENGTH)
{
    return USB_ERROR;
}

/**
  * @brief  GET_ENCAPSULATED_RESPONSE class-specific packet handler sample ([1], 6.2.2).
  * @note   The handler is expected to either perform data transfer and status
  *         stages on its own (calling USB_EP_doDataIn), or return value
  *         that is not USB_SUCCESS.
  * @param  wINDEX: Interface number
  * @param  wLENGTH: Amount of data
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummyGetEncapsulatedResp(uint16_t wINDEX, uint16_t wLENGTH)
{
    return USB_ERROR;
}
#endif /* USB_CDC_ENCAPSULATION_SUPPORTED */

