ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_CDC.c
#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
/**
  * @brief  GET_COMM_FEATURE Class-specific packet handler sample ([2], 6.3.2).
  * @param  wVALUE: Feature selector
  * @param  wINDEX: Interface number
  * @param  DATA: Place for the value of current setting.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummyGetCommFeature(uint16_t wVALUE, uint16_t wINDEX, uint16_t* DATA)
{
    return USB_ERROR;
}

/**
  * @brief  SET_COMM_FEATURE Class-specific packet handler sample ([2], 6.3.1).
  * @param  wVALUE: Feature selector
  * @param  wINDEX: Interface number
  * @param  DATA: Value to be set.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummySetCommFeature(uint16_t wVALUE, uint16_t wINDEX, uint16_t DATA)
{
    return USB_ERROR;
}

/**
  * @brief  CLEAR_COMM_FEATURE Class-specific packet handler sample ([2], 6.3.3).
  * @param  wVALUE: Feature selector
  * @param  wINDEX: Interface number
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummyClearCommFeature(uint16_t wVALUE, uint16_t wINDEX)
{
    return USB_ERROR;
}
#endif /* USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_LINE_CODING_SUPPORTED
/**
  * @brief  GET_LINE_CODING Class-specific packet handler sample ([2], 6.3.11).
  * @param  wINDEX: Interface number
  * @param  DATA: Pointer to @ref USB_CDC_LineCoding_TypeDef structure that
  *         should hold current Line Coding information.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummyGetLineCoding(uint16_t wINDEX, USB_CDC_LineCoding_TypeDef* DATA)
{
    return USB_ERROR;
}

/**
  * @brief  SET_LINE_CODING Class-specific packet handler sample ([2], 6.3.10).
  * @param  wINDEX: Interface number
  * @param  DATA: Pointer to @ref USB_CDC_LineCoding_TypeDef structure
  *         that contains the Line Coding information.
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummySetLineCoding(uint16_t wINDEX, const USB_CDC_LineCoding_TypeDef* DATA)
{
    return USB_ERROR;
}
#endif /* USB_CDC_LINE_CODING_SUPPORTED */

#ifdef USB_CDC_CONTROL_LINE_STATE_SUPPORTED
/**
  * @brief  SET_CONTROL_LINE_STATE Class-specific packet handler sample ([2], 6.3.12).
  * @param  wVALUE: Control Signal.
  *         This parameter can be any combination of the following values:
  *             @arg USB_CDC_DTR_PRESENT
  *             @arg USB_CDC_RTS_ACTIVATE_CARRIER
  * @param  wINDEX: Interface number
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummyControlLineState(uint16_t wVALUE, uint16_t wINDEX)
{
    return USB_ERROR;
}
#endif /* USB_CDC_CONTROL_LINE_STATE_SUPPORTED */

#ifdef USB_CDC_LINE_BREAK_SUPPORTED
/**
  * @brief  SEND_BREAK Class-specific packet handler sample ([2], 6.3.13).
  * @param  wVALUE: Duration of Break.
  * @param  wINDEX: Interface number
  * @retval @ref USB_Result.
  */
USB_Result USB_CDC_DummySendBreak(uint16_t wVALUE, uint16_t wINDEX)
{
    return USB_ERROR;
}
#endif /* USB_CDC_LINE_BREAK_SUPPORTED */

/** @} */ /* End of group USB_CDC_Private_Dummy_Functions */

/** @} */ /* End of group USB_CDC_Private_Functions */

/** @} */ /* End of group USB_CDC */

/** @} */ /* End of group USB_DEVICE_AND_CDC */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_usb_CDC.c */


